tsung/sample/tsung.xml
<?xml version="1.0"?><tsung loglevel="info">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="5000"/>
  </clients>
  
  <servers>
  <server host="localhost" port="8080" type="tcp"/>
</servers>

  <monitoring>
    <monitor host="localhost" type="erlang"/>
  </monitoring>
  
  <load>
  <arrivalphase phase="1" duration="30" unit="second">
     <users arrivalrate="200" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="2" duration="30" unit="second">
     <users arrivalrate="250" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="3" duration="30" unit="second">
     <users arrivalrate="300" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="350" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="400" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="450" unit="second"/>
   </arrivalphase>
  </load>

  <sessions>
  <session name="http-example" probability="100" type="ts_http">
    <request> <http url="/foobar" method="GET" version="1.1"/> </request>
  </session>
 </sessions>
</tsung>