tsung/sample/tsung.xml
<?xml version="1.0"?><tsung loglevel="info">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="50000"/>
  </clients>
  
  <servers>
    <server host="ec2-52-213-196-8.eu-west-1.compute.amazonaws.com" port="8080" type="tcp"/>
  </servers>

  <monitoring>
    <monitor host="localhost" type="erlang"/>
  </monitoring>
  
  <load>
  <arrivalphase phase="1" duration="60" unit="second">
     <users maxnumber="20000" arrivalrate="1000" unit="second"/>
   </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
  <session name="http-example" probability="100" type="ts_http">
<for from="1" to="50" incr="1" var="i">
    <request>
      <http url="/foobar/%%_i%%" method="GET" version="1.1"/>
    </request>
</for>
  </session>
 </sessions>
</tsung>